/*
Я не хочу изучать Java, я хочу большую зарплату

Вывести на экран десять раз надпись «Я не хочу изучать Java, я хочу большую зарплату»
 */

package ru.yajaneya.javarush.level3;

public class Task17 {
    public static void main(String[] args) {
        for (int i=0; i<10; i++) {
            System.out.println("Я не хочу изучать Java, я хочу большую зарплату");
        }
    }
}
