/*
Дата рождения
Вывести на экран дату своего рождения в виде: MAY 1 2012
 */

package ru.yajaneya.javarush.level3;

public class Task1 {

    public static void main(String[] args) {
        System.out.println("JUL 24 1974");
    }

}
