/*
Жить хорошо, а хорошо жить еще лучше

Вывести на экран надпись «Жить хорошо, а хорошо жить еще лучше»
 */

package ru.yajaneya.javarush.level3;

public class Task16 {
    public static void main(String[] args) {
        System.out.println("Жить хорошо, а хорошо жить еще лучше");
    }
}
